esch/STM32L052-examples/STM32_RFM95_GPS/stm32_rfm95_gps.c
/*
 * This file is part of the libopencm3 project.
 *
 * Copyright (C) 2009 Uwe Hermann <uwe@hermann-uwe.de>
 * Copyright (C) 2011 Stephen Caudle <scaudle@doceme.com>
 * Copyright (C) 2013 Piotr Esden-Tempski <piotr@esden.net>
 *
 * This library is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Lesser General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this library.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <libopencm3/stm32/rcc.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/stm32/usart.h>
#include <libopencm3/cm3/nvic.h>
#include <libopencm3/stm32/flash.h>
// #include <stdio.h>
// #include <string.h>
#include "tinysh.h" 
#include "lmic.h" 
#include "config.h" 
#include "gps.h" 
// #include "string.h" 
#include "stm32_rfm95_gps.h"


uint8_t *ugetc(void);
void uputc(uint8_t c);
void print(char *s);
void tinyshell_thread(void);
char* itoa(int i, char b[]);

int atohc(char c);


void print_decimaln (uint32_t i);
void print_decimal (uint32_t i);
void print_hex32(uint32_t v);
void print_hex16(uint16_t v);
void print_hex8(uint8_t v);
void print_s_hex8(char *s, int32_t );
void print_s_key(char *s, u1_t *key,uint8_t );
int atohc(char c);
int atoh(char *c);
void print_hex8_(uint8_t v);
void dng_fnt(int argc, char **argv);


static uint32_t isrC = 0;

uint32_t dbg_dosend = 0;

unsigned int dbg_runloop = 0;
unsigned int dbg_radio_irq = 0;
unsigned int dbg_failed = 0;
uint8_t strt_[768];


bool runState = true;
uint16_t sent_interval = 100;  // could be in sec

// ====================================================
// FLASH Settings struct
// ====================================================
// #define MY_FLASH_PAGE_ADDR 0x800FC00

#define MY_FLASH_PAGE_ADDR 0x08080000     // eeprom
#define EEPROM_DATA_ID 0xAA55


typedef struct
  {
  uint16_t ID;
  u1_t   _devAddr[4];
  u1_t   _AppSkey[16];
  u1_t   _NwkSkey[16];
  u1_t   _DEVEUI[8];
  u1_t   _APPEUI[8];

              // 8 byte = 2  32-bits words.  It's - OK
              // !!! Full size (bytes) must be a multiple of 4 !!!
  } eeprom_Settings;

eeprom_Settings settings;

  bool eeprom_SettingsValid = false;
 

// LoRaWAN Application identifier (AppEUI)
// Not used in this example
static  u1_t APPEUI[8]  = { 0x02, 0x00, 0x00, 0x00, 0x00, 0xEE, 0xFF, 0xC0 };

// LoRaWAN DevEUI, unique device ID (LSBF)
// Not used in this example
static  u1_t DEVEUI[8]   = { 0x42, 0x42, 0x45, 0x67, 0x89, 0xAB, 0xCD, 0xEF };

// LoRaWAN NwkSKey, network session key 
// Use this key for The Things Network
unsigned char NwkSkey[16] =         { 0x2B, 0x7E, 0x15, 0x16, 0x28, 0xAE, 0xD2, 0xA6, 0xAB, 0xF7, 0x15, 0x88, 0x09, 0xCF, 0x4F, 0x3C };

// LoRaWAN AppSKey, application session key
// Use this key to get your data decrypted by The Things Network
unsigned char AppSkey[16] =     { 0x2B, 0x7E, 0x15, 0x16, 0x28, 0xAE, 0xD2, 0xA6, 0xAB, 0xF7, 0x15, 0x88, 0x09, 0xCF, 0x4F, 0x3C };

// LoRaWAN end-device address (DevAddr)
// See http://thethingsnetwork.org/wiki/AddressSpace

#define msbf4_read(p)   (u4_t)((u4_t)(p)[0]<<24 | (u4_t)(p)[1]<<16 | (p)[2]<<8 | (p)[3])
unsigned char DevAddr[4] = { 0x63, 0x19, 0x06, 0x18 };

// provide application router ID (8 bytes, LSBF)
void os_getArtEui (u1_t* buf) {
    memcpy(buf, APPEUI, 8);
}

// provide device ID (8 bytes, LSBF)
void os_getDevEui (u1_t* buf) {
    memcpy(buf, DEVEUI, 8);
}

// provide device key (16 bytes)
void os_getDevKey (u1_t* buf) {
    memcpy(buf, NwkSkey, 16);
}

uint8_t mydata[64];
static osjob_t sendjob;


void onEvent (ev_t ev) {
    //debug_event(ev);

    switch(ev) {
      // scheduled data sent (optionally data received)
      // note: this includes the receive window!
      case EV_TXCOMPLETE:
          // use this event to keep track of actual transmissions
          print("EV_TXCOMPLETE, time: \r\n");
          // Serial.println(millis() / 1000);
          if(LMIC.dataLen) { // data received in rx slot after tx
              //debug_buf(LMIC.frame+LMIC.dataBeg, LMIC.dataLen);
              print("Data Received \r\n");
          }
          break;
       default:
          break;
    }
}

void do_send(osjob_t* j) {

        __asm__("NOP");                                                // XXX delay is added for Serial

    if (LMIC.opmode & OP_TXRXPEND) {
      print("OP_TXRXPEND, not sending \r\n");
      print_hex32(LMIC.opmode);
    } 
    else {
    
      print("ready to send: \r\n");
      strcpy((char *) mydata,"{\"Hello\":\"World\"}"); 
      LMIC_setTxData2(1, mydata, strlen((char *)mydata), 0);
    }
    // Schedule a timed job to run at the given timestamp (absolute system time)
    // os_setTimedCallback(j, os_getTime()+sec2osticks(WAIT_SECS), do_send);

    // defined send interval
    os_setTimedCallback(j, os_getTime()+sec2osticks( sent_interval ), do_send,"do_send");
         
}


char* itoa(int i, char b[])  // Convert Integer to ASCII!!
{
    char const digit[] = "0123456789";
    char* p = b;
    if(i<0){
        *p++ = '-';
        i *= -1;
    }
    int shifter = i;
    do{ //Move to where representation ends
        ++p;
        shifter = shifter/10;
    } while(shifter);
    *p = '\0';
    do { //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    } while(i);
    return b;
}

void smt32_read_accel(int argc, char **argv);

static void clock_setup(void)
{
	/* Enable GPIOD clock for LED & USARTs. */
	rcc_periph_clock_enable(RCC_GPIOA);

	/* Enable clocks for USART2. */
  rcc_periph_clock_enable(RCC_USART1);
  rcc_periph_clock_enable(RCC_USART2);
}

static void usart_setup(void)
{
	/* Enable the USART1 interrupt. */
  // review
  nvic_enable_irq(NVIC_USART1_IRQ);

