esch/STM32L052-examples/STM32_RFM95_GPS/stm32_rfm95_gps.c
	/* Setup GPIO pins for USART1 transmit. */
	gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO9);

	/* Setup GPIO pins for USART1 receive. */
	gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO10);
	// gpio_set_output_options(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ, GPIO10);

	/* Setup USART1 TX and RX pin as alternate function. */
	gpio_set_af(GPIOA, GPIO_AF4, GPIO9);
	gpio_set_af(GPIOA, GPIO_AF4, GPIO10);

	/* Setup USART1 parameters. */
  // usart_set_baudrate(USART1, 115200);
  // usart_set_baudrate(USART1, 9600);
  usart_set_baudrate(USART1, 19200);
	usart_set_databits(USART1, 8);
	usart_set_stopbits(USART1, USART_STOPBITS_1);
	usart_set_mode(USART1, USART_MODE_TX_RX);
	usart_set_parity(USART1, USART_PARITY_NONE);
	usart_set_flow_control(USART1, USART_FLOWCONTROL_NONE);

	/* Enable USART1 Receive interrupt. */
	usart_enable_rx_interrupt(USART1);

	/* Finally enable the USART. */
	usart_enable(USART1);

  /* GPS */
  /* Enable the USART2 interrupt. */

  nvic_enable_irq(NVIC_USART2_IRQ);
  /* Setup GPIO pins for USART1 transmit. */
  gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO3);

  /* Setup GPIO pins for USART1 receive. */
  gpio_mode_setup(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO2);
  // gpio_set_output_options(GPIOA, GPIO_OTYPE_OD, GPIO_OSPEED_25MHZ, GPIO10);

  /* Setup USART1 TX and RX pin as alternate function. */
  gpio_set_af(GPIOA, GPIO_AF4, GPIO3);
  gpio_set_af(GPIOA, GPIO_AF4, GPIO2);

  /* Setup USART1 parameters. */
  usart_set_baudrate(USART2, 9600);
  usart_set_databits(USART2, 8);
  usart_set_stopbits(USART2, USART_STOPBITS_1);
  usart_set_mode(USART2, USART_MODE_TX_RX);
  usart_set_parity(USART2, USART_PARITY_NONE);
  usart_set_flow_control(USART2, USART_FLOWCONTROL_NONE);

  USART_CR3(USART2) = (1<<12);  // ovrdis needed for GPS communication 

  /* Enable USART1 Receive interrupt. */
  usart_enable_rx_interrupt(USART2);

  /* Finally enable the USART. */
  usart_enable(USART2);


}

static void gpio_setup(void)
{
	/* Setup GPIO pin GPIO8 on GPIO port D for LED. */
	gpio_mode_setup(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO0 |  GPIO1 |GPIO8);
}


void LMIC_setup(void) {


  print("main 1 .. \r\n");
  // LMIC init
  os_init();
  print("main 2 \r\n");
  // Reset the MAC state. Session and pending data transfers will be discarded.
  LMIC_reset();
  print("main 3 \r\n");
  // Set static session parameters. Instead of dynamically establishing a session 
  // by joining the network, precomputed session parameters are be provided.
  if(eeprom_SettingsValid)
    LMIC_setSession (0x1, msbf4_read(settings._devAddr), (uint8_t*)settings._NwkSkey, (uint8_t*)settings._AppSkey);
  else
    LMIC_setSession (0x1, msbf4_read(DevAddr), (uint8_t*)NwkSkey, (uint8_t*)AppSkey);
  // Disable data rate adaptation
  LMIC_setAdrMode(0);
  // Disable link check validation
  LMIC_setLinkCheckMode(0);
  // Disable beacon tracking
  LMIC_disableTracking ();
  // Stop listening for downstream data (periodical reception)

  LMIC_stopPingable();
  // Set data rate and transmit power (note: txpow seems to be ignored by the library)

  LMIC_setDrTxpow(DR_SF7,14);


}


uint8_t tt;

extern uint32_t msec;

int main(void)
{
	clock_setup();
	gpio_setup();
	usart_setup();
  print("stm32_rfm95_gps .. ");
  println(REV);

  // read settings from eeprom
  stm32_flash_read();

  // the input is captured in the ISR
  tinyshell_thread(); 

  LMIC_setup();
    
  do_send(&sendjob);

    int cr = 0;
    while(1) {
        if( !(cr%10)) 
          println("james loop ");
 
        if( !(isrC%1000) )
            print_s_decimal("isr: ",isrC);

        if( !(cr++%10) && runState ) {
          // myled1 = myled1 ? 0 : 1;
          os_runloop();
          // cr = 0;
          } 

        for(int x = 0;x< 10;x++)
        __asm__("NOP");
        // wait_ms(50);

    }

	return 0;
}


static uint8_t data = 0xff;
static uint8_t data2 = 0xff;

static uint8_t char_[0];
static uint16_t strPtr = 0;

uint8_t *ugetc(void) {
	bool nc = false;


	if( data != 0xff ) {
		*char_ =  data;
		nc = true;
		data = 0xff;
	}

	return (nc) ? char_ : NULL;
	
}

void uputc(uint8_t c) {
	usart_send_blocking(USART1, c);

}


void usart1_isr(void)
{

  // usart_disable_rx_interrupt(USART1);
  nvic_disable_irq(NVIC_USART1_IRQ);


	/* Check if we were called because of RXNE. */
	if (((USART_CR1(USART1) & USART_CR1_RXNEIE) != 0) &&
	    ((USART_ISR(USART1) & USART_SR_RXNE) != 0)) {

		/* Indicate that we got data. */
		// gpio_toggle(GPIOA, GPIO8);

		/* Retrieve the data from the peripheral. */
		data = usart_recv(USART1);

		tinysh_char_in( data );
		/* Enable transmit interrupt so it sends back the data. */
		// usart_enable_tx_interrupt(USART1);
	}
  nvic_enable_irq(NVIC_USART1_IRQ);

}


static uint32_t dbgCr1 = 0;
static uint32_t dbgCr3 = 0;
static uint32_t dbgISR = 0;
static uint32_t dbgICR = 0;

void usart2_isr(void)
{

  // usart_disable_rx_interrupt(USART1);
  nvic_disable_irq(NVIC_USART2_IRQ);


    dbgCr1 = USART_CR1(USART2);
    dbgCr3 = USART_CR3(USART2);
    dbgISR = USART_ISR(USART2);
    dbgICR = USART_ICR(USART2);


  if( USART_ISR(USART2) & USART_SR_ORE )
      USART_ICR(USART2) &= 0x08;

  if( USART_ISR(USART2) & USART_SR_FE )
      USART_ICR(USART2) &= 0x02;

  /* Check if we were called because of RXNE. */
  if (((USART_CR1(USART2) & USART_CR1_RXNEIE) != 0) &&
      ((USART_ISR(USART2) & USART_SR_RXNE) != 0)) {


      isrC++;

    /* Retrieve the data from the peripheral. */
    data2 = usart_recv(USART2);

    if( data2 != 0x0 && data2 != 0xff ) {

      strt_[strPtr] = data2;
      strPtr = (strPtr < 500) ? strPtr + 1 : 0;

      // print("usart2 : ");
      // print_hex8(data2);
      // println("");
    }

  }
  nvic_enable_irq(NVIC_USART2_IRQ);

}


////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
char *upperCase(char *c,int size) {

    for(int x=0;x<size;x++) {
        if(c[x] >= 'a' && c[x] <= 'z' ) 
         c[x] -= 0x20;
    }

return c;
}


void smt32_devAddr(int argc, char **argv)
{
      uint16_t kSize = sizeof(DevAddr)/sizeof(DevAddr[0]);  // key size

     print_s_key("\r\nDevAddr: ",DevAddr,kSize );

