esch/STM32L052-examples/STM32_RFM95_GPS/stm32_rfm95_gps.c
    if(argc<2) {
        print("DevAddr \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"GET") ) 
            print_s_key("DevAddr: ",DevAddr,kSize );
    else if( !strcmp(argv[1],"SET") ) {
        if(argc>1) {
          println("set DevAddr ");

          if( (strlen(argv[2])>>1) != kSize ) {
              print_s_decimal(" keysize  not correct",(strlen(argv[2])>>1) );
              return;
            }

          print_s_decimal("key ",strlen(argv[2]));

          for(int x = 0; x< strlen(argv[2]) ;x+=2)
              DevAddr[x>>1] = atohc(argv[2][x]) << 4  | atohc(argv[2][x+1]);

          // put it into the settings
          memcpy(&settings._devAddr[0],DevAddr,sizeof(u1_t)*kSize);  
        }
        else
            print("no number \r\n");        
    }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_devAddr= {0,"devAddr","device address [get/set]","[get/set]",smt32_devAddr,0,0,0};

////////////////////////////////////////////////////////////////

// e.g. 
// 70B3D57EF000396F
// { 0x70, 0xB3, 0xD5, 0x7E, 0xF0, 0x00, 0x39, 0x6F }

void smt32_appeui(int argc, char **argv)
{
  // int nSize = (sizeof(APPEUI)/sizeof(APPEUI[0]));

    uint16_t kSize = sizeof(APPEUI)/sizeof(APPEUI[0]);  // key size

    print_s_key("\r\nappeui: ",APPEUI,kSize );

    if(argc<2) {
        print("appeui \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"GET") ) 
        print_s_key("\r\nappeui: ",APPEUI,kSize );
    else if( !strcmp(argv[1],"SET") ) {

        if(argc>1) {
          println("set APPEUI ");

          if( (strlen(argv[2])>>1) != kSize ) {
              print_s_decimal(" keysize  not correct",(strlen(argv[2])>>1) );
              return;
            }

          print_s_decimal("key ",strlen(argv[2]));

          for(int x = 0; x< strlen(argv[2]) ;x+=2)
              APPEUI[x>>1] = atohc(argv[2][x]) << 4  | atohc(argv[2][x+1]);

          // put it into the settings
          memcpy(&settings._APPEUI[0],APPEUI,sizeof(u1_t)*kSize);  
        }
        else
            print("no number \r\n");        
    }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_appeui= {0,"appeui","app eui value [get/set]","[get/set]",smt32_appeui,0,0,0};


////////////////////////////////////////////////////////////////


void smt32_deveui(int argc, char **argv)
{

    uint16_t kSize = sizeof(DEVEUI)/sizeof(DEVEUI[0]);  // key size

    print_s_key("\r\ndeveui: ",DEVEUI,kSize );

    if(argc<2) {
        print("deveui \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"GET") ) 
        print_s_key("\r\ndeveui: ",DEVEUI,kSize );
    else if( !strcmp(argv[1],"SET") ) {
        if(argc>1) {
          println("set DEVEUI ");

          if( (strlen(argv[2])>>1) != kSize )
              print_s_decimal(" keysize  not correct",(strlen(argv[2])>>1) );

          print_s_decimal("key ",strlen(argv[2]));

          for(int x = 0; x< strlen(argv[2]) ;x+=2)
              DEVEUI[x>>1] = atohc(argv[2][x]) << 4  | atohc(argv[2][x+1]);

          // put it into the settings
          memcpy(&settings._DEVEUI[0],DEVEUI,sizeof(u1_t)*kSize);  

          print_s_key("new deveui: ",DEVEUI,kSize );
        }
        else
            print("no number \r\n");        
    }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_deveui= {0,"deveui","device eui [get/set]","[get/set]",smt32_deveui,0,0,0};



void smt32_nwkSkey(int argc, char **argv)
{

    uint16_t kSize = sizeof(NwkSkey)/sizeof(NwkSkey[0]);  // key size

    print_s_key("nwkSkey: ",NwkSkey,kSize );

   if(argc<2) {
        print("nwkSkey \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"GET") ) 
        print_s_key("\r\nnwkSkey: ",NwkSkey,kSize );
    else if( !strcmp(argv[1],"SET") ) {
        if(argc>1) {
          println("set NwkSkey ");

          if( (strlen(argv[2])>>1) != kSize )
              print_s_decimal(" keysize  not correct",(strlen(argv[2])>>1) );

          print_s_decimal("key ",strlen(argv[2]));

          for(int x = 0; x< strlen(argv[2]) ;x+=2)
              NwkSkey[x>>1] = atohc(argv[2][x]) << 4  | atohc(argv[2][x+1]);

                      // put it into the settings
          memcpy(&settings._NwkSkey[0],NwkSkey,sizeof(u1_t)*kSize);  

          print_s_key("new DevAddr: ",NwkSkey,kSize );
        }
        else
            print("no number \r\n");        
    }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_nwkSkey= {0,"nwkSkey","network session key [get/set]","[get/set]",smt32_nwkSkey,0,0,0};


void smt32_appSkey(int argc, char **argv)
{


    uint16_t kSize = sizeof(AppSkey)/sizeof(AppSkey[0]);  // key size

    print_s_key("\r\nappSkey: ",AppSkey,kSize );

    if(argc<2) {
        print("appSkey \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"GET") ) 
            print_s_key("appSkey: ",AppSkey,kSize );
    else if( !strcmp(argv[1],"SET") ) {
        if(argc>1) {
          println("set appSkey ");

          if( (strlen(argv[2])>>1) != kSize )
              print_s_decimal(" keysize  not correct",(strlen(argv[2])>>1) );

          print_s_decimal("key ",strlen(argv[2]));

          for(uint32_t x = 0; x<strlen(argv[2]);x+=2)
              AppSkey[x>>1] = atohc(argv[2][x]) << 4  | atohc(argv[2][x+1]);

                      // put it into the settings
          memcpy(&settings._AppSkey[0],AppSkey,sizeof(u1_t)*kSize);  

          print_s_key("new appSkey: ",AppSkey,kSize );


        }
        else
            print("no number \r\n");
        
    }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_appSkey= {0,"appSkey","application session key [get/set]","[get/set]",smt32_appSkey,0,0,0};




void smt32_loraCtrl(int argc, char **argv)
{

