esch/STM32L052-examples/STM32_RFM95_GPS/stm32_rfm95_gps.c
    if(runState)
      println("\r\nlora Ctrl: running" );
    else
      println("\r\nlora Ctrl: stopped" );

    if(argc<2) {
        // print("appSkey \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"START") ) {
          println("start lora ");
         runState = true;
       }
    else if( !strcmp(argv[1],"STOP") ) {
        println("stop lora ");
        runState = false;
      }
    else if( !strcmp(argv[1],"INIT") ) {
            println("init \r\n");
            // maybe the restart can be done automatically ??
            if(runState) runState = false;
            LMIC_setup();
            println("lora new init applied, please start it again");          
    }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_ctrllora = {0,"lora","lora control [start/stop/init]","[start/stop/init]",smt32_loraCtrl,0,0,0};


void smt32_loraFreq(int argc, char **argv)
{

    println("\r\nlora Frequency: " );

    if(argc<2) {
        // print("appSkey \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"FIX") ) 
          println("set freq 1 (868 MHz) ");
    else if( !strcmp(argv[1],"RND") )
          println("stop lora ");
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_freq_lora = {0,"f_lora","set lora frequency [fix 1...7/random]","[fix/rnd]",smt32_loraFreq,0,0,0};


void smt32_loraTimeInt(int argc, char **argv)
{

    print_s_decimal("\r\nlora sending time interval: ",sent_interval );

    if(argc<2) {
        // print("appSkey \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"GET") ) 
          print_s_decimal("\r\nlora sending time interval: ",sent_interval );
    else if( !strcmp(argv[1],"SET") ) {
          sent_interval = _atoi(argv[2]);
          print_s_decimal("setting time interval ",sent_interval);
        }
    else {
        print("unknown command \r\n");   
    }  


}

tinysh_cmd_t cmd_timeInt = {0,"tint","time interval [get/set 100] in sec","[get/set]",smt32_loraTimeInt,0,0,0};


void smt32_gps(int argc, char **argv)
{

  // process_gps();

  print_gps();

#ifdef LATER
  nvic_disable_irq(NVIC_USART2_IRQ);

int lastStartP = 2000;
int endP = 2000;

    char tStr[256];

    int c = 0;

    do {
       if( ! strncmp( strt_+c,"$GNGGA",6) || ! strncmp( strt_+c,"$GNRMC",6) )
       // if( ! strncmp( strt_+c,"$GNGGA",6)  )
          lastStartP = c;

       if( lastStartP != 2000 && strt_[c] == '*')      
          endP = c;
 
      // } while( c++ < 450 && lastStartP == 2000 );
      } while( c++ < 450 && endP == 2000 );

   print_s_decimal("lastStartP ",lastStartP);
   print_s_decimal("c ",c);

  nvic_enable_irq(NVIC_USART2_IRQ);

    if( lastStartP  != 2000 && endP != 2000 )  {
      strncpy(tStr,strt_+lastStartP, endP - lastStartP + 2); 

      decodeGP("$GNGGA",tStr, endP - lastStartP );

      tStr[lastStartP+ (endP - lastStartP)+3] = 0;   
      print_s_hex8(tStr,0x01);
    }
 

    print_s_decimal("\r\ngps ",strPtr );
    print_s_hex8("\r\nlast char: ",data2 );
    // print_s_hex32("\r\nuart2: ",reg32 );
    print_s_hex32("dbg CR1: ",dbgCr1 );
    print_s_hex32("dbg CR3: ",dbgCr3 );
    print_s_hex32("dbg ISR: ",dbgISR );
    print_s_hex32("dbg ICR: ",dbgICR );
    
    print_s_decimal("isr counter ",isrC );
    println("");
#endif    

}

tinysh_cmd_t cmd_gps = {0,"gps","gps data ","[...]",smt32_gps,0,0,0};



////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
/////// TINY SHELL EXAMPLE AS THREAD ///////////////////////////

static  char *cmds [] = {
                        (char *)"Syntax: help",
                        (char *)"Function:",
                        (char *)"  'help'  print this help info",
                        (char *)"  'dbg'  ",
                        };

int nItems = (sizeof(cmds)/sizeof(cmds[0]));


void dng_fnt(int argc, char **argv)
{

  println("\r\n");

  if( argc>0 )
    println(argv[1]);

  print_s_decimal("time [msec]: ",msec);
  print_s_decimal("run loop: ",dbg_runloop);
  print_s_decimal("radio irqs dbg: ",dbg_radio_irq);
  print_s_decimal("assert dbg: ",dbg_failed);

}

tinysh_cmd_t mydbgcmd= {0,"dbg","dbg command / [set] dbg level 0 - 6","[set]",dng_fnt,0,0,0};


void stm32_flash(int argc, char **argv)
{

    println("\r\nflash: " );

    if(argc<2) {
        // print("appSkey \r\n");
        return;
    }


    upperCase(argv[1],strlen(argv[1]) );

    if( !strcmp(argv[1],"READ") ) {
          println("read flash ");
          stm32_flash_read();
    }
    else if( !strcmp(argv[1],"WRITE") ) {
          println("write flash ");
          stm32_flash_write();
    }
    else if( !strcmp(argv[1],"PRINT") ) {
          println("print settings: ");
          // print_s_hex8("para 1: ", settings.Parameter1);
          // print_s_hex8("para 2: ", settings.Parameter2);

          // print_s_hex32("para 4: ", settings.Parameter4);
          print_s_key("set DevAddr: ",settings._devAddr,(sizeof(DevAddr)/sizeof(DevAddr[0])) );
          print_s_key("set AppSKey: ",settings._AppSkey,(sizeof(AppSkey)/sizeof(AppSkey[0])) );
          print_s_key("set NwkSkey: ",settings._NwkSkey,(sizeof(NwkSkey)/sizeof(NwkSkey[0])) );
          print_s_key("set DEVEUI : ",settings._DEVEUI,(sizeof(DEVEUI)/sizeof(DEVEUI[0])) );
          print_s_key("set APPEUI : ",settings._APPEUI,(sizeof(APPEUI)/sizeof(APPEUI[0])) );
    }
    else {
        print("unknown command \r\n");   
    }  

}

tinysh_cmd_t cmd_flash= {0,"flash","flash [read/write/print] setting","[read/write/print]",stm32_flash,0,0,0};


void tinysh_char_out(uint8_t c)
{
    uputc(c);
}

//void tinyshell_thread(void const *args)
void tinyshell_thread(void)
{
    // pc.baud(115200);
    print("STM32 tiny shell build (nonrtos) \n\r");
    tinysh_set_prompt("$ ");
    tinysh_add_command(&mydbgcmd);

