esch/STM32L052-examples/STM32_RFM95_GPS/stm32_rfm95_gps.c
    tinysh_add_command(&cmd_ctrllora);
    tinysh_add_command(&cmd_flash);

    tinysh_add_command(&cmd_freq_lora);
    tinysh_add_command(&cmd_timeInt);
    tinysh_add_command(&cmd_gps);


    

    tinysh_add_command(&cmd_devAddr);

    tinysh_add_command(&cmd_deveui);
    tinysh_add_command(&cmd_appeui);

    tinysh_add_command(&cmd_nwkSkey);
    tinysh_add_command(&cmd_appSkey);

}

////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
bool debug = true;

// void print_d(char *s)
// {

//     if(debug) {
//         for(unsigned int x =0; x<strlen((uint8_t *)s); x++)
//             uputc(s[x]);
//     }
// }


void print(char *s)
{
    if(debug) {
        for(unsigned int x =0; x<strlen((uint8_t *)s); x++)
            uputc(s[x]);
    }
}

void println(char *s)
{
    print(s);
    print("\r\n");
}



void tinysh_puts(uint8_t *s)
{

    for(unsigned int x =0; x<strlen(s); x++)
       uputc(s[x]);
}


void print_hex8_(uint8_t v) {
    int i, h;
    for (i = 4; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            uputc('0' + h);
        } else {
            uputc('A' + h - 10);
        }
    }
}

void print_hex8(uint8_t v) {
    uputc('0');
    uputc('x');

    print_hex8_(v);
}


void print_hex16(uint16_t v) {
    int i, h;
    uputc('0');
    uputc('x');

    for (i = 12; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            usart_send_blocking(USART1,'0' + h);
        } else {
            usart_send_blocking(USART1,'A' + h - 10);
        }
    }
  usart_send_blocking(USART1, '\r');
  usart_send_blocking(USART1, '\n');
}

void print_hex32(uint32_t v) {
    int i, h;
    uputc('0');
    uputc('x');

    for (i = 28; i >= 0; i -= 4) {
        h = (v >> i) & 0x0f;
        if (h < 10) {
            uputc('0' + h);
        } else {
            uputc('A' + h - 10);
        }
    }

  uputc('\r');  
  uputc('\n');  
}

void print_decimal (uint32_t i) {
    uint8_t buf[16];
    uint32_t j = 0;

    if (i == 0) {
        usart_send_blocking(USART1,'0');
        return;
    }

    if (i < 0) {
        usart_send_blocking(USART1,'-');
        i *= -1;
    }
    while (i > 0) {
        buf[j++] = '0' + i % 10;
        i /= 10;
    }
    while (j > 0) {
        usart_send_blocking(USART1,buf[--j]);
    }

}

void print_decimaln (uint32_t i) {

  print_decimaln(i);
  usart_send_blocking(USART1, '\r');
  usart_send_blocking(USART1, '\n');

}


void print_s_decimal(char *s, uint32_t i) {
    print(s);
    print_decimal(i);
    print("\r\n");

}

void print_s_hex8(char *s, int32_t i) {
    print(s);
    print_hex8(i);
    print("\r\n");

}

void print_s_hex32(char *s, int32_t i) {
    print(s);
    print_hex32(i);
    // print("\r\n");

}


void print_s_key(char *s, u1_t *key,uint8_t nSize) {

    print(s);
    for(int i = 0;i<nSize;i++)
      print_hex8_(key[i]);
    println("");
}

// ascii to hex , single character
int atohc(char c) {

if(c>='A' && c<='F') return (c - 'A' + 10);
if(c>='a' && c<='f') return (c - 'a' + 10);
if(c>='0' && c<='9') return (c - '0');

return 0;
}


int _atoi(char *str)
{
    int res = 0; // Initialize result
  
    // Iterate through all characters of input string and
    // update result
    for (int i = 0; str[i] != '\0'; ++i)
        res = res*10 + str[i] - '0';
  
    // return result.
    return res;
}

// ascii to hex for double character
int atoh(char *c) {
int v = 0;
for(int x=0;x<2;x++) 
  v+= (x==1)  ? atohc(c[x]):atohc(c[x])*16;

return v;
}




#define SETTINGS_WORDS sizeof(settings)/4

void FLASH_Init(void) {
  /* Next commands may be used in SysClock initialization function
     In this case using of FLASH_Init is not obligatorily */
  /* Enable Prefetch Buffer */
  // FLASH_PrefetchBufferCmd( FLASH_PrefetchBuffer_Enable);
  flash_prefetch_enable();
  /* Flash 2 wait state */
  flash_set_ws( FLASH_ACR_LATENCY_1WS );
  // FLASH_SetLatency( FLASH_Latency_2);
}

void FLASH_ReadSettings(void) {
  //Read settings
  uint32_t *source_addr = (uint32_t *)MY_FLASH_PAGE_ADDR;
  uint32_t *dest_addr = (void *)&settings;
  for (uint16_t i=0; i<SETTINGS_WORDS; i++) {
    *dest_addr = *(uint32_t*)source_addr;
    source_addr++;
    dest_addr++;
  }
}

void FLASH_WriteSettings(void) {
  // FLASH_Unlock();
  // flash_unlock();
  // FLASH_ErasePage(MY_FLASH_PAGE_ADDR);

  // Write settings
  uint32_t *source_addr = (void *)&settings;
  uint32_t *dest_addr = (uint32_t *) MY_FLASH_PAGE_ADDR;
  for (uint16_t i=0; i<SETTINGS_WORDS; i++) {

    // FLASH_ProgramWord((uint32_t)dest_addr, *source_addr);
    eeprom_program_word((uint32_t)dest_addr, *source_addr);
    source_addr++;
    dest_addr++;
  }
  // flash_lock();
  // FLASH_Lock();
}
// ====================================================


void stm32_flash_read(void) {
  FLASH_Init();
  FLASH_ReadSettings();
  if( settings.ID == EEPROM_DATA_ID ) {
    println("EEPROM_DATA_ID OK");
    eeprom_SettingsValid = true;
  }
  else {
    println("EEPROM_DATA_ID NOT OK");
    settings.ID = EEPROM_DATA_ID;
    eeprom_SettingsValid = false;
  }
}


void stm32_flash_write(void) {
  FLASH_Init();
  FLASH_WriteSettings();
}



// $GNGGA,160408.000,4612.7511,N,00556.4940,E,1,09,1.2,633.0,M,0.0,M,,*79